version and readme
