--- a/README.md
+++ b/README.md
@@ -7,32 +9,19 @@ view your heartbeat inside the quest game
 
-# 心率局域网接收软件 - Quest（BeatSaber模组）
-这是一个可以在quest上查看心率的节奏光剑模组，[下载apk](https://github.com/frto027/HeartbeatLanServer/releases/latest)后，可以显示手机上的蓝牙心率设备。
+```mermaid
+graph TD;
+    POLAR_H10[Polar H10]
+    SMART_WATCH[Shart watch, broadcast heartrate]
+    BLE_DEV[other BLE heartrate devs]
+    PHONE[phone. android apk]
+    BEATSABER[beatsaber quest mod, <b>YOU ARE HERE</b>]
 
-1. 在手机上安装[这个](https://github.com/frto027/HeartbeatLanServer/releases/latest)软件，事先配对好蓝牙心率设备。打开并选择需要发送数据的蓝牙设备。
-2. 在quest上安装[这个mod](https://github.com/frto027/HeartBeatLanClientBSQuest/releases/latest)（通过BMBF或者QuestPatcher软件）。
-3. 打开游戏，只要手机和quest在一个局域网内，左上角会显示心率。
-4. (可选)左侧有设置菜单可以配置。如果局域网内由多个人都在用这个软件，可以在游戏中过滤一下服务或者心率设备。
-
-```
-                                         ┌─────────┐
-                      YOU ARE HERE───────►beatsaber│
-                                         │ (quest) │
-                                         └─────▲───┘
-                                               │
-                                               │ ┌──────┐
-┌─────────┐   Bluetooth(BLE)                   │ │......│
-│POLAR H10├────────────────┐                   │ └───▲──┘
-└─────────┘                │                   │     │
-                           │                   │     │
-┌───────────┐              │   ┌─────────────┐ │     │
-│Smart watch├──────────────┼──►│Android Phone├─┴─────┘UDP Package
-└───────────┘              │   └─────────────┘        via WLAN
-                           │
-┌────────────────────────┐ │
-│BLR Heartrate Devices...├─┘
-└────────────────────────┘
+    POLAR_H10--蓝牙-->PHONE;
+    SMART_WATCH--蓝牙-->PHONE;
+    BLE_DEV--蓝牙-->PHONE;
+    PHONE--局域网-->BEATSABER;
+    PHONE--局域网-->...;
 ```
 
 # Dev.
